{"id":11689,"date":"2018-02-03T18:26:01","date_gmt":"2018-02-03T08:26:01","guid":{"rendered":"https:\/\/confettidesign.utihnob6-liquidwebsites.com\/?page_id=11689"},"modified":"2021-01-28T18:57:39","modified_gmt":"2021-01-28T08:57:39","slug":"confetti-design-terms-and-conditions","status":"publish","type":"page","link":"https:\/\/confettidesign.com.au\/confetti-design-terms-and-conditions\/","title":{"rendered":"Terms and Conditions"},"content":{"rendered":"<p>[vc_row][vc_column][vc_row_inner][vc_column_inner][vc_column_text]<\/p>\n<h1 class=\"text-pink\">Confetti Design Terms and Conditions<\/h1>\n<p>[\/vc_column_text][\/vc_column_inner][\/vc_row_inner][vc_column_text css=&#8221;.vc_custom_1596920340440{padding-bottom: 30px !important;}&#8221;]<\/p>\n<div id=\"text-block-3\" class=\"mk-text-block \">\n<p>It is the client’s responsibility to read and to make themselves aware of the Confetti Design Terms and Conditions.<\/p>\n<p>All quotes are valid for 3 months.<\/p>\n<p><strong><br \/>\nScope of Works<\/strong><\/p>\n<p>During the project briefing, it is client’s responsibility to provide us with clear guidelines along with the flow or specific details you may require. When such details are not provided, we will proceed with our understanding of your requirements and quote accordingly. At a later stage, if a discrepancy arises, it may lead to additional costs to accommodate the changes. This includes additional pages to the base cost quoted. Additional page costs may range from $400 ex GST to $75 ex GST subject to the content and amount of design or development required.<br \/>\nThus, it is essential that you clarify every aspect of your website development and ensure that you have been quoted on the right requirements.<\/p>\n<p>Once the quote has been finalised, any additions, changes or enhancements in the functionality or design of the project will affect the proposal and may incur additional cost and a revised delivery date. All additional work, over and above the estimates is charged separately. Under no circumstances will Confetti Design be liable for any delays caused by change in the project brief.<\/p>\n<p>Any complexity related to specific deliverable, must be advised in advance and included in the proposal for costing purposes. We operate in good faith and rely on our clients to disclose the full picture of their expectations. Any discrepancy arising due to unclear requirements or expectations will not be borne by Confetti Design.<\/p>\n<p>Website content and all related materials need to be provided to us within the first four weeks of starting the project, unless otherwise agreed. Any delays thereafter may delay the project and may incur additional charges if it goes beyond reasonable timeframe, however we make every effort to keep projects on time even in event of client’s content delivery delay if we have the capacity to do so. Confetti Design will inform if a delay will impact delivery schedules.<\/p>\n<p>The client must recognize that at times there may be unforeseen circumstances that will delay the development process, particularly with reference to the integration of third party software or unforeseen schedule interruptions. We will try our best to complete the project as agreed in the proposal. As long as it is within a reasonable period, the client agrees not to penalize us for any genuine delay, when every effort to keep the project on the proposed schedule is taken.<\/p>\n<p>Upon approval of project designs and payment for building stage Confetti Design allows for 2 rounds of changes to the development site. Any changes outside of background colour, copy or image will incur extra costs. Any deviations from the approved designs will incur extra costs.<\/p>\n<p><strong><br \/>\n3<sup>rd<\/sup>Party Software<\/strong><\/p>\n<p>Confetti Design takes no responsibility of any of the third-party products, software or components used in the website development such as payment gateway, SSL certificates etc. We suggest you take regular back-ups to avoid any disruptions. Confetti Design takes no responsibility of any open source products such as WordPress, Open Source carts, Joomla etc. It is client’s responsibility to update all components and third party software, unless prior agreement that Confetti Design has been contracted to do so on your behalf.<\/p>\n<p>Changes to the third-party provider’s rules and policies may ultimately affect the services we provide or the terms and conditions herein. Confetti Design uses WordPress CMS to develop business websites. The client owns copyrights of all codes written for the client. In some instances, Confetti Design creates custom software for the client, for their use only, however Confetti Design owns the code (a custom-built diagnostic tool for example). The client <em>may<\/em>pay either a one-off fee for the use of this custom software as agreed or will pay an annual fee.<\/p>\n<p><strong><br \/>\nDomain Registration<\/strong><br \/>\nDomain registration charges are not included as a part of the proposal unless mentioned otherwise. If domain registration is part of the project, the renewal of that domain will be charged in time to keep the domain and then invoiced to client.<br \/>\nIf the client does not pay for the renewal fee within the time allocated the responsibility for the domain lies with the client and not Confetti Design.<br \/>\nThe client will need to act to re-claim the domain. This may affect the website being live and is not the responsibility of Confetti Design. Confetti Design will take all reasonable action to notify client of the domain registration dates.<\/p>\n<p><strong><br \/>\nWebsite Hosting<\/strong><\/p>\n<p>Hosting charges are not included in the quotations unless mentioned otherwise.<br \/>\nConfetti Design offers managed WordPress hosting that includes an automatic SSL certificate. Hosting is paid for by subscription. It does not include website security.<\/p>\n<p>The client may wish to organise their own hosting, and it is their responsibility to keep this hosting account active, not that of Confetti Design. Where clients decide to organise their own hosting, we should be consulted before finalising the type of hosting and database, as it should meet the requirements of the technology used for the development.<br \/>\nPlease note that we’ll require full access with hosting support for testing and deploying the application.<\/p>\n<p>Confetti Design will not be liable for any delays or errors caused by direct or indirect actions of the hosting company.<br \/>\nConfetti Design cannot give access to their test servers and test websites to the clients or any third party. Technology support of additional 5 working hours is given to all medium and large size projects, for any basic modification or changes, which may be utilised for up to a period of one month after the delivery, called the User Acceptance Period.<br \/>\nPlease note that these support hours are not applicable if the design or coding or any other aspect of the website has been altered by anyone other than the Confetti Design team.<\/p>\n<p><strong><br \/>\nPayment &amp; Refunds<\/strong><\/p>\n<p>All prices are quoted in Australian dollars are exclusive of GST unless specified.<br \/>\nAll invoices are to be processed as per the schedule via your preferred method of payment. Milestone payments must be made within 5 working days of each milestone\/schedule, unless mutually agreed otherwise.<br \/>\nFinal payment must be made prior to website going live or being moved to client allocated hosting.<\/p>\n<ul>\n<li>Receipt of payment is deemed as acceptance of the quote, milestone, delivery or project.<\/li>\n<li>Confetti Design reserves the right to negotiate and refund appropriate portion of the amount paid by customer towards the requested service.<\/li>\n<li>If you cancel your order after making the payment, but the work has not commenced, we will refund 75% of the payment that you have already made.<\/li>\n<li>If the order is cancelled after the commencement of work, the maximum refund or charge will be 50% of the invoice.<\/li>\n<li>There will be no refund or adjustments if cancellation is communicated when more than 50% of the work has been completed.<\/li>\n<li>All cancellations must be received in writing and can be sent via email.<\/li>\n<li>Telephone requests on cancellations will not be accepted. For minor or once-off works, payments need to be made either in advance or as per the terms mentioned in the invoice\/proposal.<\/li>\n<li>All works completed on an existing site are to paid for up front with 50% and then 50% upon completion, unless otherwise agreed.<\/li>\n<li>If invoices are not attended to within 10 working days a Maintenance page will be put up until payment is received.<\/li>\n<li>If you require any changes to the terms, you must inform us in writing (emails accepted) within two working days of the receipt of the same.<\/li>\n<\/ul>\n<p><strong><br \/>\nLate fees and charges.<\/strong><\/p>\n<p>All outstanding invoices will incur a late payment fee of 10% of the pending amount and an administration fee of $5.50 per month, from the due date.<\/p>\n<ul>\n<li>Due date: Is the date on which the payment is due as per the terms on the invoice\/proposal<\/li>\n<li>Outstanding Invoice: An invoice is deemed to be outstanding if the payment is still due after 14days of the expiry of the due date.<\/li>\n<li>Debt Collection: Client is provided a further 7 days after late payment fee is applied to pay the invoice. Failure to pay will result in the outstanding amount referred to a debt collector.<\/li>\n<\/ul>\n<p>Confetti Design will not be liable for any costs or charges associated with the recovery of the outstanding amount. Any charges associated with the recovery of the outstanding amount (debt collectors, administration charges, legal fees) will be referred to the client for processing. If you are late with a payment or have any queries regarding the Invoice, please contact us immediately on receiving the invoice or reminder emails.<br \/>\nAll communications\/correspondences is generally done via emails. It is client’s responsibility to keep us updated with their relevant email addresses.<br \/>\nAny payment relating to the domain name registration renewal or hosting or any 3rd party products or service purchased on behalf of the client will have to be in full and is non-refundable.<br \/>\nIf client chooses a 3rd party hosting provider prior to starting a project, Confetti Design will build and test the website on one of our own servers or hosted domains. The website may be transferred-off to the nominated 3rd party server upon full payment of all invoices and dues.<\/p>\n<p><strong><br \/>\nIntellectual Property<\/strong><\/p>\n<p>Confetti Design reserves the right to refuse the transfer of ownership if irregular circumstances arise. Copyrights handed over to the client do not include rights to re-use the code for another website or re-sell the programming codes for any commercial or non-commercial purposes. In the case of business restructuring or ownership change, ownership of the website may be transferred from one owner to another. New owners are not allowed to re-sell or re-use unique coded information (e.g diagnostic tools) for any commercial or non-commercial purpose.<br \/>\nIn an event of a Webmaster change, site owners are not allowed to display new design credits to the new website, unless such time that the website functionality and appearance is changed by over 50% of our original work.<br \/>\nClients, Partners, Suppliers, Sub-contractors and any other 3rd party organisation or individual are not allowed to use Confetti Design name, logo and symbol in any way shape or form without a written permission from us.<\/p>\n<p><strong><br \/>\nDisputes, Liability and Indemnity<\/strong><\/p>\n<p>In an event of a dispute, Confetti Design reserves the right to charge the client in full for the work done as well as for the resources spent in managing the dispute.<br \/>\nIn such an event, Confetti Design reserves the right to charge the client without honouring any discounts that were previously offered in good faith.<\/p>\n<p>Under no circumstances will Confetti Design be liable for any damages arising from misrepresentation or misinformation. Once an agreement is entered into, if the agreed timeline moves out for any unforeseen circumstances, Confetti Design is in no way liable for any ‘perceived’ loss of business.<\/p>\n<p>Confetti Design will go to reasonable lengths to rectify any issues that pertain to the original briefing for the project.<\/p>\n<p>Confetti Design reserves the right to refuse service to any client, if the client, their business or their customers are not aligned with our business operating principles and policies.<br \/>\nConfetti Design provides its services as is, without any guarantees on security or other issues leading to loss of data, sale or reputation.<br \/>\nWe ensure to the best of our ability that our systems and servers are protected from hackers, viruses, intruders and other online and offline problems, however we will not be held liable for any disruption of services if such situation arises.<\/p>\n<p>Relationship of Confetti Design with its suppliers, partners and sub-contractors is of an independent nature. None of the parties have any power, right or authority to interfere or bind the other or assume or create any obligation or responsibility, whether expressed or implied, on behalf of the other or in the other’s name.<\/p>\n<p>Client will indemnify and hold Confetti Design, its licensors, content providers, service providers, employees, agents, officers, directors, contractors and sub-contractors (the “Indemnified Parties”) harmless from your breach of any of these Terms And Conditions or any other terms, conditions, policies or procedures herein, including, without limitation, any use of content other than as expressly authorized in these Terms and Conditions.<\/p>\n<p>Client agrees that the indemnified parties will have no liability in connection with any such breach or unauthorized use, and you agree to indemnify and hold harmless the Indemnified Parties from any and all resulting loss, damages, judgments, awards, costs, expenses, and attorneys’ fees in connection therewith. You will also indemnify and hold the Indemnified Parties harmless from and against any claims brought by third parties arising out of your use of the information obtained from Confetti Design.<\/p>\n<p>Confetti Design will not be liable for any breach of the agreement which is caused by a matter beyond its reasonable control including but not limited to Act of God, fire, lightning, explosion, war, disorder, flood, earth quake, industrial disputes (whether or not involving their employees), extremely severe weather, or acts of local or central government or other competent authorities.<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<p>[\/vc_column_text][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column][vc_row_inner][vc_column_inner][vc_column_text] Confetti Design Terms and Conditions [\/vc_column_text][\/vc_column_inner][\/vc_row_inner][vc_column_text css=&#8221;.vc_custom_1596920340440{padding-bottom: 30px !important;}&#8221;] It is the client’s responsibility [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v15.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Confetti Design Terms and Conditions | Melbourne, AU<\/title>\n<meta name=\"description\" content=\"It is the client’s responsibility to read and to make themselves aware of the Confetti Design Terms and Conditions. All quotes are valid for 3 months.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/confettidesign.com.au\/confetti-design-terms-and-conditions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Confetti Design Terms and Conditions | Melbourne, AU\" \/>\n<meta property=\"og:description\" content=\"It is the client’s responsibility to read and to make themselves aware of the Confetti Design Terms and Conditions. All quotes are valid for 3 months.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/confettidesign.com.au\/confetti-design-terms-and-conditions\/\" \/>\n<meta property=\"og:site_name\" content=\"Confetti Design\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/confettidesignmelbourne?ref=bookmarks\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-28T08:57:39+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/confettidesign.com.au\/wp-content\/uploads\/2017\/03\/confe-screenshot.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1344\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"11 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/confettidesign.com.au\/#organization\",\"name\":\"Confetti Design\",\"url\":\"https:\/\/confettidesign.com.au\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/confettidesignmelbourne?ref=bookmarks\",\"https:\/\/www.instagram.com\/confettidesignmelb\/\",\"https:\/\/www.linkedin.com\/in\/johannahbarton\/\",\"https:\/\/www.youtube.com\/channel\/UCmmZe1EV3exgxKHmq_GqTpg?view_as=subscriber\",\"https:\/\/www.pinterest.com.au\/ConfettiDesMelb\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/confettidesign.com.au\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/confettidesign.com.au\/wp-content\/uploads\/2017\/12\/logo_confetti2.png\",\"width\":196,\"height\":137,\"caption\":\"Confetti Design\"},\"image\":{\"@id\":\"https:\/\/confettidesign.com.au\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/confettidesign.com.au\/#website\",\"url\":\"https:\/\/confettidesign.com.au\/\",\"name\":\"Confetti Design\",\"description\":\"Design Agency Bayside Melbourne Based | Branding and Websites for Small Business\",\"publisher\":{\"@id\":\"https:\/\/confettidesign.com.au\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/confettidesign.com.au\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/confettidesign.com.au\/confetti-design-terms-and-conditions\/#webpage\",\"url\":\"https:\/\/confettidesign.com.au\/confetti-design-terms-and-conditions\/\",\"name\":\"Confetti Design Terms and Conditions | Melbourne, AU\",\"isPartOf\":{\"@id\":\"https:\/\/confettidesign.com.au\/#website\"},\"datePublished\":\"2018-02-03T08:26:01+00:00\",\"dateModified\":\"2021-01-28T08:57:39+00:00\",\"description\":\"It is the client\\u2019s responsibility to read and to make themselves aware of the Confetti Design Terms and Conditions. All quotes are valid for 3 months.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/confettidesign.com.au\/confetti-design-terms-and-conditions\/\"]}]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","_links":{"self":[{"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/pages\/11689"}],"collection":[{"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/comments?post=11689"}],"version-history":[{"count":7,"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/pages\/11689\/revisions"}],"predecessor-version":[{"id":13958,"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/pages\/11689\/revisions\/13958"}],"wp:attachment":[{"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/media?parent=11689"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}