{"id":13617,"date":"2020-04-14T15:38:53","date_gmt":"2020-04-14T05:38:53","guid":{"rendered":"https:\/\/confettidesign.com.au\/?p=13617"},"modified":"2020-04-14T17:34:32","modified_gmt":"2020-04-14T07:34:32","slug":"instagram-guide-start-right","status":"publish","type":"post","link":"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/","title":{"rendered":"Instagram Guide – Start Right"},"content":{"rendered":"<p>[vc_row][vc_column][vc_column_text]<span style=\"font-weight: 400;\">You have your pick of social media platforms, but for retailers the most successful and popular at the moment is Instagram. In the US 71% of businesses are on Instagram, there is no denying it is the place to be, and the visual nature of Instagram makes it likely to be the leader for a while to come.<br \/>\nIf you are not on Instagram then read up on our easy to follow steps so you start the right way. If you are already a gun on ‘the gram’ then these tips will be a good checklist to make sure you stay at the top of your game!<br \/>\nThis guide will take you through the 4 steps to starting in Instagram the right way that will make both the returns for your efforts and the on-going management so much easier.<br \/>\n<\/span><\/p>\n<h3><strong>Step 1 – Understanding your customer<\/strong><\/h3>\n<p>Before you even think of creating the account, you want to get crystal clear on who your jewelry customer is. Truly understanding your target market is one of the most crucial things in running a successful business. It is only by having a clear idea in your mind of who you would like to reach, sell to or help that you can tailor and target your messages to have the strongest impact on your audience.<\/p>\n<p>This has to be the key step that underpins your future success on Instagram. And really any marketing activity. Without it all your posting is like a scatter gun approach and the likelihood of connecting with your audience is slim.<\/p>\n<p><strong>Why do you need to know your customer so clearly?<\/strong><\/p>\n<p>1. You can create content to engage and connect with them when you have them in the forefront of your mind.<br \/>\n2. You can ask yourself ‘will our perfect customer relate to this, be inspired to act, feel an emotional connection, be moved, feel like we ‘get them?’<br \/>\n3. If you wish to use influencers, knowing who your customer is ensures you pick the right influencer.<br \/>\n4. Engaging in cross promotions is easier as you look for other businesses who share the same customer.<br \/>\n5. Although not a direct impact on your Instagram activity, knowing WHERE your customer hangs out or what they do in their life can guide your traditional marketing efforts. Local cafes to be linked with, event venues, magazines to advertise in. When you know where your customer spends their life means you can position yourself literally in their sight!<\/p>\n<p><strong>The Basics<\/strong><\/p>\n<p>• What are your customer’s values? What is important to them?<br \/>\n• What is their lifestyle? Or how do they spend their time? What is important to them?<br \/>\n• What is their age?<br \/>\n• Where do they live?<br \/>\n• Is there a specific gender you serve more than another? – Who is really doing the research on your product?<br \/>\n• What brands do they love?<br \/>\n• Where do they eat, holiday, shop regularly?<br \/>\n• What are their aspirations?<br \/>\n• What magazines do they read, films watch, Netflix shows?<\/p>\n<p><strong>The Problems<\/strong><\/p>\n<p>• List all the problems you solve for your customers?<br \/>\n• What emotions do they feel at the exact moment they discover your store and service?<br \/>\n• What specific words and phrases are they saying to themselves or using to friends when describing how it feels to discover your service?<\/p>\n<p><strong>The Solutions<\/strong><\/p>\n<p>It doesn’t matter whether you could realistically deliver or create these experiences, the goal is simply to unlock your imagination and challenge yourself to step into your customer’s shoes and see things in a new way. These insights will help with the type of content you create and how you try to engage your customers via Instagram.<br \/>\nBefore they found you what was their reality as it relates to buying a product like yours?<br \/>\n• How were they trying to solve the problem?<br \/>\n• Where were they looking to find a solution?<br \/>\n• Who were they talking to in order to find a solution?<br \/>\n• How was it impacting their personal life?<br \/>\n• Have they tried other solutions before?<br \/>\n• Why did that solution not work for them? Why are they still looking?<br \/>\n• What do they wish Jewelers understood about them?<br \/>\n• What is your customer’s dream? In their ideal world, what’s their ultimate fantasy of how your product or service would be delivered?<br \/>\n• Do they have barriers to purchase from you?<\/p>\n<p>The answers to these questions help build out a real picture of your target audience\/s. Now you have this ‘persona’ or ‘ideal customer’ described it’s useful to even go to the extent of naming them, find images from magazines to visualize the perfect customers. It may be that you base this avatar on one of your best customers. In fact you could go to your most loyal customer and ask them to help answer the questions.<\/p>\n<p>You not only have an amazing understanding of who you need to connect with via your posts, you also have a huge amount of content right in those answers. To see how we use all this fantastic insights be sure to download the guide called Instagram – Creating Content That Engages.<br \/>\nNow we move onto the goal setting step.<\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Step 2 &#8211; Set Your Goals<\/strong><\/h3>\n<p>Now you have a good idea of who you want to become your brand follower, come into your store or click through to your website, you want to get your goals clear. The reason we do this is that having a clear goal or 2 or 3 goals allows you to purposefully create content and more chance of achieving the set goals.<\/p>\n<p>Haphazardly posting is not a viable strategy when it comes to Instagram for business. Once you define who is your customer you need to define what it is your brand wants to do, then you can begin to better speak the language of your followers.<\/p>\n<p><strong>How to Create a Social Media Goal<\/strong><\/p>\n<p>Use the oldie-but-goodie SMART technique to set your goals.<\/p>\n<p>S- <strong>Specific <\/strong><\/p>\n<p>Goals should be clear and simple, but very detailed in terms of what you want to happen.<\/p>\n<p>NOT SPECIFIC &#8211; increase our followers<br \/>\nSPECIFIC &#8211; increase our followers by 100% by end of month August 2019<\/p>\n<p>M- <strong>Measurable <\/strong><\/p>\n<p>You will need to have a goal that you can measure, and there are a lot of social media tools that can help you measure the success of your strategy such as Instagram Insights. Ensure your website has analytics so you can track the number of new users that come from your Instagram account to specific product pages.<\/p>\n<p>You can use a tool like Bitly.com that is a unique trackable url you can put into your bio.<br \/>\nIf you would like more reading on this..here is an article that lists 8 Instagram Analytics Tools <a href=\"https:\/\/www.brandwatch.com\/blog\/instagram-analytics-tools\/\">https:\/\/www.brandwatch.com\/blog\/instagram-analytics-tools\/<\/a><\/p>\n<p>A- <strong>Action Oriented <\/strong><\/p>\n<p>This part is where you’ll create actionable task that will turn your goal into reality. Your “plan of attack will be detailed here as you create your goal.<\/p>\n<p>An example of a goal is to increase the traffic to your store or online store that results in 20 new sales directly via your Instagram account in the month of August. This goal could include the following actions:<\/p>\n<ul>\n<li>Post offers that are redeemed in store or online<\/li>\n<li>Post blogs<\/li>\n<li>Post new products<\/li>\n<li>Linked In-store activities – launch of a new product or a joint wedding dress fashion show with local bridal boutique in your store<\/li>\n<li>Post snippet of a video with full length video on the website<\/li>\n<\/ul>\n<p>R- <strong>Realistic <\/strong><\/p>\n<p>With all your resources on hand (time, money, people), is the goal you’re setting realistic? This is what you need to keep in mind when creating your goal. This is where you may reduce your goal or look to outsource some tasks to achieve the goals.<\/p>\n<p>T- <strong>Time Bound <\/strong><\/p>\n<p>Every goal needs a deadline, otherwise it’s not a goal—it’s a wishful thinking. Keeping in mind the complexity of the actions, as well as your resources, create a time frame that is both suitable to the goal as well as realistic.[\/vc_column_text][vc_empty_space height=&#8221;40px&#8221;][\/vc_column][\/vc_row][vc_row full_width=&#8221;stretch_row_content_no_spaces&#8221; equal_height=&#8221;yes&#8221; content_placement=&#8221;middle&#8221; el_id=&#8221;single-cta-section&#8221; css=&#8221;.vc_custom_1585788789229{background-color: #f4f4f4 !important;}&#8221;][vc_column width=&#8221;3\/5&#8243; css=&#8221;.vc_custom_1585788827698{padding-top: 0px !important;}&#8221; el_class=&#8221;left-col&#8221;][vc_empty_space height=&#8221;40px&#8221;]<div class=\"edgtf-call-to-action-holder  edgtf-simple-layout\">\n\t<div class=\"edgtf-cta-inner \">\n\t\t<div class=\"edgtf-cta-text-holder\">\n\t\t\t<div class=\"edgtf-cta-text\">\n<h2>Whether you are starting up a business or thinking about your current digital marketing, give us a call.<\/h2>\n<p>We can help.<\/p>\n<\/div>\n\t\t<\/div>\n\t\t<div class=\"edgtf-cta-button-holder\" >\n\t\t\t<div class=\"edgtf-cta-button\"><a itemprop=\"url\" href=\"tel:0400650667\" target=\"_self\" style=\"color: #ffffff;background-color: #ca0043;border-color: #ca0043\" class=\"edgtf-btn edgtf-btn-medium edgtf-btn-solid edgtf-btn-custom-hover-bg edgtf-btn-custom-border-hover edgtf-btn-custom-hover-color\" data-hover-color=\"#ca0043\" data-hover-bg-color=\"rgba(201,0,47,0.01)\" data-hover-border-color=\"#ca0043\" >    <span class=\"edgtf-btn-text\">Call now 0400 650 667<\/span>    <\/a><\/div>\n\t\t<\/div>\n\t<\/div>\n<\/div>[vc_empty_space height=&#8221;40px&#8221;][\/vc_column][vc_column width=&#8221;2\/5&#8243; css=&#8221;.vc_custom_1585788715332{padding-top: 0px !important;background-image: url(https:\/\/confettidesign.com.au\/wp-content\/uploads\/2020\/04\/blogPage_bannerCta_image-2.png?id=13500) !important;background-position: center !important;background-repeat: no-repeat !important;background-size: cover !important;}&#8221; el_class=&#8221;right-col&#8221;][vc_empty_space height=&#8221;400px&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<strong>You can create just a few goals to avoid being overwhelmed. Some of the most common Social Media goals are: <\/strong><\/p>\n<ul>\n<li>Increased brand awareness<\/li>\n<li>Drive sales through traffic to your website<\/li>\n<li>Drive sales through traffic to your store<\/li>\n<li>Demonstrate company culture<\/li>\n<li>Showcase your team and recruit new talent<\/li>\n<li>Increase customer engagement and loyalty<\/li>\n<li>Showcase products<\/li>\n<li>Share company or industry news<\/li>\n<li>Build a more engaged community<\/li>\n<li>Connect with influencers<\/li>\n<\/ul>\n<p><strong>An example in action <\/strong><\/p>\n<p>Let’s look at an example of a SMART goal for Increase Brand Awareness in the next 2 months:<\/p>\n<p><strong>Specific- <\/strong>Build up brand awareness of the new website within two-month period<\/p>\n<p><strong>Measurable- <\/strong>Reach 1,000 traffic increase in the next month and another 1,000 the following month.<\/p>\n<p><strong>Action Oriented &#8211; <\/strong>Create pre-launch content to be posted to build momentum. Encourage pre-launch sign up for a discount or advanced warning of specials. During the first week of a product launch, create a post every 2 days with calls to action to the new website, sharing reviews, new product, video’s of users with product, unboxing experiences or blog posts on related topics to the launch and product. This can include paid sponsored ads<\/p>\n<p><strong>Realistic &#8211; <\/strong><\/p>\n<p>✓ Ads Budget : 8 week period x 2.5 posts a week x $10 = $200<\/p>\n<p>✓ Content writer and graphic designer hired to create materials<\/p>\n<p><strong>Time Bound- <\/strong>2 month period with check point of 1 month<\/p>\n<p><strong>Set Your Baseline <\/strong><\/p>\n<p>It is important that before you take any actions in your social media account against this goal that you have set your starting point. This means that you have the data from an analytics point of view on where you’re currently at (traffic to your site, bounce rates, particular page visits.) so that you’ll know exactly how your statistics are improving after implementing your actions.<\/p>\n<p><strong>Check Points <\/strong><\/p>\n<p>Lastly, set up check points to review your statistics so that you’ll see which is working or not. Is the ad budget boosting enough or reaching your preferred audience? Or is brand awareness really what you should focus on? You can check the social media and google analytics that you’ve set to gauge and evaluate your efforts.<\/p>\n<p>Now you have a goal or set of goals you need a clear strategy to achieve these. However before we embark on that we need to do the one thing that makes all of our efforts easier, understanding our customer.<\/p>\n<h3><strong>Step 3 &#8211; Now you have a clear vision of the customer to attract and a goal or set of goals your next step is to create a social media strategy. <\/strong><\/h3>\n<p><strong>Let’s recap <\/strong>– Goal #1 &#8211; Increase Brand Awareness in next 2 months<\/p>\n<p>It is tricky to translate your social media efforts into sales especially when you’re in a brick and mortar business. However not including a social media strategy is effectively ignoring a huge portion of the potential customers.<\/p>\n<p>Common metrics that can be measured are:<\/p>\n<ul>\n<li>Number of followers<\/li>\n<li>Number of clicks through to the website from Instagram<\/li>\n<li>Number of sales using unique Instagram promo code<\/li>\n<li>Number of tags on other pages<\/li>\n<li>Number of check ins<\/li>\n<li>Number of comments<\/li>\n<\/ul>\n<p><strong>Instagram strategies to achieve this goal could be: <\/strong><\/p>\n<ul>\n<li>Build content themes to speak to a problem of target audience<\/li>\n<li>Share products your customer loves more than any others<\/li>\n<li>Create articles that are indirectly related to your product but your customer would find helpful. Link these articles to your website, include the products on the blogs as an indirect selling opportunity<\/li>\n<li>Share reviews that overcome barriers your customers have<\/li>\n<li>Run a competition for free tickets to an event your customer would love to go to in your local area. One of the great benefits of having a location centric business is your customer is near you<\/li>\n<li>Include your customers in video or in user generated content<\/li>\n<li>Offer rewards for customers who share an unboxing image or video tagging you<\/li>\n<li>Implement Instagram shopping on your website and linked to your account<\/li>\n<li>Engage an influencer who shares your customer<\/li>\n<li>Share other Instagram pages and content that your customer audience also follows to broaden your reach<\/li>\n<li>Always reply or like any comments<\/li>\n<li>Uncover niche hashtags that your customer is also following. Similarly, location-specific hashtags are perfect for zeroing in on an audience in your own neighborhood.<\/li>\n<li>Consider the time of day to share when you know your audience is on the platform. Set up a schedule for posting so you are also not on it 24\/7!<\/li>\n<li>Tell stories to captivate your audience, the narrative of your brand is just as important as your customer in your content.<\/li>\n<\/ul>\n<p>The list can go on.. but you have a comprehensive guide now of how to get started right, even before you set your account. The next guide will cover setting up your account and then the final in the series is about creating the content with purpose to achieve your goals.[\/vc_column_text][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You have your pick of social media platforms, but for retailers the most successful and popular at the moment is Instagram. In the US 71% of businesses are on Instagram, there is no denying it is the place to be, and the visual nature of Instagram makes it likely to be the leader for a while to come.<\/p>\n","protected":false},"author":1,"featured_media":13624,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[188,1418,185,191],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v15.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Instagram Guide – Start Right - Confetti Design<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Instagram Guide – Start Right - Confetti Design\" \/>\n<meta property=\"og:description\" content=\"You have your pick of social media platforms, but for retailers the most successful and popular at the moment is Instagram. In the US 71% of businesses are on Instagram, there is no denying it is the place to be, and the visual nature of Instagram makes it likely to be the leader for a while to come.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/\" \/>\n<meta property=\"og:site_name\" content=\"Confetti Design\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/confettidesignmelbourne?ref=bookmarks\" \/>\n<meta property=\"article:published_time\" content=\"2020-04-14T05:38:53+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-04-14T07:34:32+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/confettidesign.com.au\/wp-content\/uploads\/2020\/04\/Confetti-Design-Instagram-scaled.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"1707\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\">\n\t<meta name=\"twitter:data1\" content=\"12 minutes\">\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/confettidesign.com.au\/#organization\",\"name\":\"Confetti Design\",\"url\":\"https:\/\/confettidesign.com.au\/\",\"sameAs\":[\"https:\/\/www.facebook.com\/confettidesignmelbourne?ref=bookmarks\",\"https:\/\/www.instagram.com\/confettidesignmelb\/\",\"https:\/\/www.linkedin.com\/in\/johannahbarton\/\",\"https:\/\/www.youtube.com\/channel\/UCmmZe1EV3exgxKHmq_GqTpg?view_as=subscriber\",\"https:\/\/www.pinterest.com.au\/ConfettiDesMelb\/\"],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/confettidesign.com.au\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/confettidesign.com.au\/wp-content\/uploads\/2017\/12\/logo_confetti2.png\",\"width\":196,\"height\":137,\"caption\":\"Confetti Design\"},\"image\":{\"@id\":\"https:\/\/confettidesign.com.au\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/confettidesign.com.au\/#website\",\"url\":\"https:\/\/confettidesign.com.au\/\",\"name\":\"Confetti Design\",\"description\":\"Design Agency Bayside Melbourne Based | Branding and Websites for Small Business\",\"publisher\":{\"@id\":\"https:\/\/confettidesign.com.au\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":\"https:\/\/confettidesign.com.au\/?s={search_term_string}\",\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/confettidesign.com.au\/wp-content\/uploads\/2020\/04\/Confetti-Design-Instagram-scaled.jpg\",\"width\":2560,\"height\":1707,\"caption\":\"Confetti Design Instagram\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/#webpage\",\"url\":\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/\",\"name\":\"Instagram Guide \\u2013 Start Right - Confetti Design\",\"isPartOf\":{\"@id\":\"https:\/\/confettidesign.com.au\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/#primaryimage\"},\"datePublished\":\"2020-04-14T05:38:53+00:00\",\"dateModified\":\"2020-04-14T07:34:32+00:00\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/\"]}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/#webpage\"},\"author\":{\"@id\":\"https:\/\/confettidesign.com.au\/#\/schema\/person\/eb72a8b513d4ef3fb53b668c12328e29\"},\"headline\":\"Instagram Guide \\u2013 Start Right\",\"datePublished\":\"2020-04-14T05:38:53+00:00\",\"dateModified\":\"2020-04-14T07:34:32+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/#webpage\"},\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/confettidesign.com.au\/#organization\"},\"image\":{\"@id\":\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/#primaryimage\"},\"articleSection\":\"BUSINESS DEVELOPMENT,E-Commerce Websites,SMALL BUSINESS MARKETING,SOCIAL MEDIA MARKETING\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/confettidesign.com.au\/instagram-guide-start-right\/#respond\"]}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/confettidesign.com.au\/#\/schema\/person\/eb72a8b513d4ef3fb53b668c12328e29\",\"name\":\"confetti2admin\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/confettidesign.com.au\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/184adbd0c8eaee46930b078025195164?s=96&d=mm&r=g\",\"caption\":\"confetti2admin\"},\"sameAs\":[\"Barton\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","_links":{"self":[{"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/posts\/13617"}],"collection":[{"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/comments?post=13617"}],"version-history":[{"count":8,"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/posts\/13617\/revisions"}],"predecessor-version":[{"id":13644,"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/posts\/13617\/revisions\/13644"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/media\/13624"}],"wp:attachment":[{"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/media?parent=13617"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/categories?post=13617"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/confettidesign.com.au\/wp-json\/wp\/v2\/tags?post=13617"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}